# -*- coding: utf-8 -*-
"""
Created on Mon May 14 15:19:02 2018

@author: Dyson
"""

發生了： 発生了： Happened:

2017-06-14 15:29 UTC+8 
瓜地馬拉 グアテマラ Guatemala 
M6.9

2017-06-22 20:31 UTC+8 
瓜地馬拉 グアテマラ Guatemala
M6.8

2017-07-18 07:34 UTC+8 
俄羅斯 ロシア Russia 
M7.7

2017-09-08 12:49 UTC+8 
墨西哥 メキシコ Mexico 
M8.1

2017-09-08 01:26 UTC+8
日本小笠原群島 日本小笠原諸島 Chichi-shima, Japan
M6.1

2017-09-11 10:25 UTC+8 
宜蘭 宜蘭 Yilan 
M4.5

2017-10-24 18:47 UTC+8
印尼 インドネシア Indonesia
M6.7
震央大約在台灣南方2,000公里

2017-10-31 08:42:06 UTC+8
新喀里多尼亞 ニューカレドニア New Caledonia
M6.8
震央大約在台灣東南方5,000公里

2017-10-31 19:50 UTC+8
印尼 インドネシア Indonesia
M6.3
震央大約在台灣南方2,000公里

2017-11-04 17:00 UTC+8
東加 トンガ Tonga
M6.8
震央大約在台灣東南方5,000公里

2017-11-08 05:26 UTC+8 
巴布亞紐幾內亞 パプアニューギニア Papua New Guinea
M6.5
震央大約在台灣東南方2,500公里

2017-11-09 15:42 UTC+8 日本 日本 Japan
M6.0
震央大約在台灣東北方1,500公里

2017-11-11 20:22 UTC+8 
南投 南投 Nantou
M5.1
    
2017-11-13 02:18 UTC+8
伊拉克 イラク Iraq 
M7.3
震央大約在台灣西北方5,000公里

2017-11-13 10:28 UTC+8
哥斯大黎加 コスタリカ Costa Rica
M6.5
震央大約在台灣東南方15,000公里

2017-11-15 13:29 UTC+8
韓國 韓国 South Korea
M5.4
震央大約在台灣東北方1,000公里

2017-11-18 06:34 UTC+8
西藏 チベット Tibet
M6.3
震央大約在台灣西北方1,800公里

2017-11-19 17:25 UTC+8
新克里多尼亞 ニューカレドニア New Caledonia
M6.4
震央大約在台灣東南方5,000公里

2017-11-19 23:09 UTC+8
新克里多尼亞 ニューカレドニア New Caledonia
M6.6
震央大約在台灣東南方5,000公里

2017-11-20 06:43 UTC+8
新克里多尼亞 ニューカレドニア New Caledonia
M7.0
震央大約在台灣東南方5,000公里

2017-11-21 02:51 UTC+8
薩摩亞 サモア Samoa
M6.0
震央大約在台灣東南方5,000公里

2017-11-22 22:20 UTC+8 
嘉義 嘉義 Chiayi
M5.5

2017-12-18 18:47 UTC+8 
宜蘭外海 
M4.2

2017-12-16 00:47 UTC+8
印尼 インドネシア Indonesia
M6.5

2017-12-21 06:40 UTC+8 
宜蘭外海 
M5.2

洪都拉斯M7.6可能是黃色訊號的前震。
主震應該還沒發生。

2018-01-10 10:51 UTC+8
洪都拉斯 ホンジュラス Honduras
M7.6

2018-01-14 17:18 UTC+8
秘魯 ペルー Peru
M7.1

2018-01-23 17:31 UTC+8
阿拉斯加 アラスカ Alaska
M8.2
    
黃色訊號還在跑，應該還有更大的地震會發生。
把阿拉斯加也列入危險範圍。
修正各站預測為：
24日以內，阿拉斯加、伊朗、緬甸、南日本、南太平洋或南美洲，M9+。

2018-02-05 09:45 UTC+8
台南 
M3.6

各站的黃色訊號還在跑，已經跑了5個多月。
修正M9+預測為：
30日以內，小笠原群島、菲律賓或台東外海，M9+。

2018-02-04 21:56 UTC+8 花蓮 M6.1
2018-02-06 23:50 UTC+8 花蓮 M6.4
2018-02-12 10:26 UTC+8 花蓮 M4.2
2018-02-19 22:47 UTC+8 宜蘭縣大同鄉 M5.3
2018-02-21 13:22 UTC+8 高雄市桃源區 M3.8
2018-02-22 07:10 UTC+8 花蓮外海 M5.6
2018-02-22 21:18 UTC+8 花蓮 M4.1
2018-02-23 13:25 UTC+8 臺南 M3.5
2018-03-01 21:42 UTC+8 沖繩 M5.9
2018-03-20 17:22 UTC+8 嘉義 M5.2
